In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
# pandas series object can be created using np.arrays, lists, dictionaries

In [3]:
#series objects work like hash tables and enable faster look up.

# DataFrame

In [11]:
i = np.random.rand((16)).reshape(4,4)
i

array([[0.91638072, 0.36007669, 0.72806866, 0.30838239],
       [0.25373375, 0.55660246, 0.20214345, 0.480424  ],
       [0.58653159, 0.1537079 , 0.00425941, 0.20913723],
       [0.25813368, 0.95506677, 0.33638941, 0.39788387]])

In [12]:
index = ["i1","i2","i3","i4"]
columns = ["A","B","C","D"]

df = pd.DataFrame(i,index,columns)

In [13]:
df

           A         B         C         D
i1  0.916381  0.360077  0.728069  0.308382
i2  0.253734  0.556602  0.202143  0.480424
i3  0.586532  0.153708  0.004259  0.209137
i4  0.258134  0.955067  0.336389  0.397884

In [14]:
#fetching individual rows

In [18]:
df.loc["i1"]

A    0.916381
B    0.360077
C    0.728069
D    0.308382
Name: i1, dtype: float64

In [20]:
#fetching multiple rows by name
df.loc[["i1","i3"]]

           A         B         C         D
i1  0.916381  0.360077  0.728069  0.308382
i3  0.586532  0.153708  0.004259  0.209137

In [21]:
# Use of Iloc 
# iloc is used to fetch the rows by integer index location

In [2]:
#df.describe() is uded to describe the dataframe.

In [19]:
df = pd.DataFrame({'A':[1,2,np.nan,3],'B':[10,np.nan,np.nan,np.nan],'C':[100,200,300,400]})

In [20]:
df

     A     B    C
0  1.0  10.0  100
1  2.0   NaN  200
2  NaN   NaN  300
3  3.0   NaN  400

In [21]:
# dropna will drop the rows which contain none
df.dropna()

     A     B    C
0  1.0  10.0  100

In [22]:
# param axis = 1 implies check columns
df.dropna(axis=1)

     C
0  100
1  200
2  300
3  400

In [24]:
df.dropna(thresh=2)

     A     B    C
0  1.0  10.0  100
1  2.0   NaN  200
3  3.0   NaN  400

In [25]:
#fill na is used to fill the missing values with the argument sent.
df.fillna("KUNAL")

       A      B    C
0      1     10  100
1      2  KUNAL  200
2  KUNAL  KUNAL  300
3      3  KUNAL  400

# Group By

In [26]:
df = pd.read_csv("C:\\Users\\KARAN S07\\Desktop\\Final Year\\Deep Learning\\TF-Course-Notebooks\\TF_Course_Notebooks\\01-Pandas-Crash-Course\\Universities.csv")

In [27]:
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [28]:
df.tail()

,Sector,University,Year,Completions,Geography
202,"Private for-profit, 2-year",Carrington College-Las Vegas,2012,120,Nevada
203,"Public, 4-year or above",Western Nevada College,2012,495,Nevada
204,"Private for-profit, 2-year",Nevada Career Institute,2012,101,Nevada
205,"Private not-for-profit, 2-year",Expertise Cosmetology Institute,2012,129,Nevada
206,"Public, 2-year",Truckee Meadows Community College,2012,1170,Nevada

In [29]:
df.groupby('Year')

In [30]:
df.groupby('Year').mean()

      Completions
Year
2012   535.078947
2013   526.150000
2014   588.809524
2015   597.250000
2016   609.860465

In [31]:
# grouping by multiple columns

In [32]:
df.groupby(['Year','Sector']).mean()

                                              Completions
Year Sector
2012 Private for-profit, 2-year                204.800000
     Private for-profit, 4-year or above       158.000000
     Private for-profit, less-than 2-year      189.571429
     Private not-for-profit, 2-year            332.500000
     Private not-for-profit, 4-year or above   353.000000
     Public, 2-year                           1170.000000
     Public, 4-year or above                  2068.000000
2013 Private for-profit, 2-year                190.812500
     Private for-profit, 4-year or above       155.000000
     Private for-profit, less-than 2-year      183.000000
     Private not-for-profit, 2-year            235.500000
     Private not-for-profit, 4-year or above   338.666667
     Public, 2-year                           1633.000000
     Public, 4-year or above                  2136.166667
2014 Private for-profit, 2-year                184.812500
     Private for-profit, 4-year or above       251.000000
     Private for-profit, less-than 2-year      166.000000
     Private not-for-profit, 2-year            224.500000
     Private not-for-profit, 4-year or above   347.333333
     Public, 2-year                           2286.000000
     Public, 4-year or above                  2527.000000
2015 Private for-profit, 2-year                205.000000
     Private for-profit, 4-year or above       163.250000
     Private for-profit, less-than 2-year      203.625000
     Private not-for-profit, 2-year            212.500000
     Private not-for-profit, 4-year or above   409.333333
     Public, 2-year                           2355.000000
     Public, 4-year or above                  2676.000000
2016 Private for-profit, 2-year                205.375000
     Private for-profit, 4-year or above       124.666667
     Private for-profit, less-than 2-year      194.000000
     Private not-for-profit, 2-year            161.000000
     Private not-for-profit, 4-year or above   302.000000
     Public, 2-year                           2431.000000
     Public, 4-year or above                  2779.500000

# Operations

In [33]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [34]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [37]:
# unique will give the unique rows in data frame
df_one['col1'].unique()

array([100, 200, 300, 400, 500], dtype=int64)

In [ ]:
#nunique will give the number of unique in data fram